backend/benchmarks/veterinaries.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:5000' }}"
  phases:
    - duration: 5
      arrivalRate: 1
    - duration: 15
      arrivalRate: 1
  defaults:
    headers:
      Accept: "application/json"
scenarios:
  - name: "List veterinaries (cached endpoint)"
    flow:
      - get:
          url: "/api/appointments/veterinaries"
      - get:
          url: "/api/appointments/veterinaries"